In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {"Name" : ["A","B","C","D"],
    "Roll no" : [1,2,3,4],
    "DOB" : ['12-1-2008','13-11-1996','5-10-2000','1-2-1999'],
    "Brand" : ["Apple","Samsung","Nokia",np.nan],
    "Marks" : ["100","88","91","69"]}

d

{'Name': ['A', 'B', 'C', 'D'],
 'Roll no': [1, 2, 3, 4],
 'DOB': ['12-1-2008', '13-11-1996', '5-10-2000', '1-2-1999'],
 'Brand': ['Apple', 'Samsung', 'Nokia', nan],
 'Marks': ['100', '88', '91', '69']}

In [3]:
data = pd.DataFrame(d)

data

  Name  Roll no         DOB    Brand Marks
0    A        1   12-1-2008    Apple   100
1    B        2  13-11-1996  Samsung    88
2    C        3   5-10-2000    Nokia    91
3    D        4    1-2-1999      NaN    69

In [4]:
type(data)

pandas.core.frame.DataFrame

In [5]:
data.shape

(4, 5)

In [6]:
data.size

20

In [7]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
data.columns

Index(['Name', 'Roll no', 'DOB', 'Brand', 'Marks'], dtype='object')

In [10]:
data['Name']

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [12]:
a = data.Name
a

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [13]:
type(a)

pandas.core.series.Series

In [15]:
data.index = data.Name

In [16]:
data

     Name  Roll no         DOB    Brand Marks
Name
A       A        1   12-1-2008    Apple   100
B       B        2  13-11-1996  Samsung    88
C       C        3   5-10-2000    Nokia    91
D       D        4    1-2-1999      NaN    69

In [17]:
data = data.drop("Name",axis=1)

In [18]:
data

      Roll no         DOB    Brand Marks
Name
A           1   12-1-2008    Apple   100
B           2  13-11-1996  Samsung    88
C           3   5-10-2000    Nokia    91
D           4    1-2-1999      NaN    69

In [19]:
data.dtypes

Roll no     int64
DOB        object
Brand      object
Marks      object
dtype: object

In [20]:
data.Marks.dtypes = int

AttributeError: can't set attribute

In [21]:
data.Marks = data.Marks.astype('int64')

In [22]:
data.dtypes

Roll no     int64
DOB        object
Brand      object
Marks       int64
dtype: object

In [23]:
data

      Roll no         DOB    Brand  Marks
Name
A           1   12-1-2008    Apple    100
B           2  13-11-1996  Samsung     88
C           3   5-10-2000    Nokia     91
D           4    1-2-1999      NaN     69

In [24]:
data = data.rename({'DOB' : 'Date of Birth'},axis =1)

In [25]:
data

      Roll no Date of Birth    Brand  Marks
Name
A           1     12-1-2008    Apple    100
B           2    13-11-1996  Samsung     88
C           3     5-10-2000    Nokia     91
D           4      1-2-1999      NaN     69

In [26]:
data.isnull().sum()

Roll no          0
Date of Birth    0
Brand            1
Marks            0
dtype: int64

In [27]:
data.isna().sum()

Roll no          0
Date of Birth    0
Brand            1
Marks            0
dtype: int64

In [31]:
data.nunique()

Roll no          4
Date of Birth    4
Brand            3
Marks            4
dtype: int64

In [33]:
data.value_counts()

Roll no  Date of Birth  Brand    Marks
1        12-1-2008      Apple    100      1
2        13-11-1996     Samsung  88       1
3        5-10-2000      Nokia    91       1
dtype: int64

In [34]:
data.describe()

        Roll no       Marks
count  4.000000    4.000000
mean   2.500000   87.000000
std    1.290994   13.038405
min    1.000000   69.000000
25%    1.750000   83.250000
50%    2.500000   89.500000
75%    3.250000   93.250000
max    4.000000  100.000000

In [35]:
data.dtypes

Roll no           int64
Date of Birth    object
Brand            object
Marks             int64
dtype: object

In [38]:
data['Date of Birth']

Name
A     12-1-2008
B    13-11-1996
C     5-10-2000
D      1-2-1999
Name: Date of Birth, dtype: object

In [39]:
data = data.rename({'Date of Birth' : 'DOB'},axis =1)

In [40]:
data

      Roll no         DOB    Brand  Marks
Name
A           1   12-1-2008    Apple    100
B           2  13-11-1996  Samsung     88
C           3   5-10-2000    Nokia     91
D           4    1-2-1999      NaN     69

In [41]:
data['DOB']

Name
A     12-1-2008
B    13-11-1996
C     5-10-2000
D      1-2-1999
Name: DOB, dtype: object

In [42]:
data.dtypes

Roll no     int64
DOB        object
Brand      object
Marks       int64
dtype: object

In [43]:
data.DOB = data.DOB.astype('int64')

ValueError: invalid literal for int() with base 10: '12-1-2008'

In [44]:
data.DOB = pd.to_datetime(data.DOB)

C:\Users\Hp\AppData\Local\Temp\ipykernel_29096\1507776873.py:1: UserWarning: Parsing '13-11-1996' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  data.DOB = pd.to_datetime(data.DOB)

In [45]:
data.dtypes

Roll no             int64
DOB        datetime64[ns]
Brand              object
Marks               int64
dtype: object

In [46]:
data['DOB']

Name
A   2008-12-01
B   1996-11-13
C   2000-05-10
D   1999-01-02
Name: DOB, dtype: datetime64[ns]

In [47]:
data.DOB.dt.year

Name
A    2008
B    1996
C    2000
D    1999
Name: DOB, dtype: int64

In [48]:
data.DOB.dt.month

Name
A    12
B    11
C     5
D     1
Name: DOB, dtype: int64

In [49]:
data.DOB.dt.day

Name
A     1
B    13
C    10
D     2
Name: DOB, dtype: int64

In [50]:
data.DOB.dt.week

C:\Users\Hp\AppData\Local\Temp\ipykernel_29096\2446383885.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  data.DOB.dt.week

Name
A    49
B    46
C    19
D    53
Name: DOB, dtype: int64

In [51]:
data.DOB.dt.day_name()

Name
A       Monday
B    Wednesday
C    Wednesday
D     Saturday
Name: DOB, dtype: object

In [52]:
data.DOB.dt.month_name()

Name
A    December
B    November
C         May
D     January
Name: DOB, dtype: object

In [53]:
data['Month']=data.DOB.dt.month_name()
data

      Roll no        DOB    Brand  Marks     Month
Name
A           1 2008-12-01    Apple    100  December
B           2 1996-11-13  Samsung     88  November
C           3 2000-05-10    Nokia     91       May
D           4 1999-01-02      NaN     69   January

In [54]:
data['Maried']=0
data

      Roll no        DOB    Brand  Marks     Month  Maried
Name
A           1 2008-12-01    Apple    100  December       0
B           2 1996-11-13  Samsung     88  November       0
C           3 2000-05-10    Nokia     91       May       0
D           4 1999-01-02      NaN     69   January       0

In [55]:
data.dropna(axis=0)

      Roll no        DOB    Brand  Marks     Month  Maried
Name
A           1 2008-12-01    Apple    100  December       0
B           2 1996-11-13  Samsung     88  November       0
C           3 2000-05-10    Nokia     91       May       0

In [56]:
data

      Roll no        DOB    Brand  Marks     Month  Maried
Name
A           1 2008-12-01    Apple    100  December       0
B           2 1996-11-13  Samsung     88  November       0
C           3 2000-05-10    Nokia     91       May       0
D           4 1999-01-02      NaN     69   January       0

In [62]:
data = data.fillna("undefined")
data

      Roll no        DOB    Brand  Marks     Month  Maried
Name
A           1 2008-12-01  Samsung    100  December       0
B           2 1996-11-13  Samsung     88  November       0
C           3 2000-05-10  Samsung     91       May       0
D           4 1999-01-02  Samsung     69   January       0

In [58]:
data.isna().sum()

Roll no    0
DOB        0
Brand      0
Marks      0
Month      0
Maried     0
dtype: int64

In [65]:
#data.Brand == "Samsung"

In [68]:
data[data.Marks<90]

      Roll no        DOB    Brand  Marks     Month  Maried
Name
B           2 1996-11-13  Samsung     88  November       0
D           4 1999-01-02  Samsung     69   January       0

In [69]:
data[(data.Month == "November") | (data.Month == "December")]

      Roll no        DOB    Brand  Marks     Month  Maried
Name
A           1 2008-12-01  Samsung    100  December       0
B           2 1996-11-13  Samsung     88  November       0

In [70]:
m = ["November","December"]
data[data.Month.isin(m)]

      Roll no        DOB    Brand  Marks     Month  Maried
Name
A           1 2008-12-01  Samsung    100  December       0
B           2 1996-11-13  Samsung     88  November       0

In [71]:
data

      Roll no        DOB    Brand  Marks     Month  Maried
Name
A           1 2008-12-01  Samsung    100  December       0
B           2 1996-11-13  Samsung     88  November       0
C           3 2000-05-10  Samsung     91       May       0
D           4 1999-01-02  Samsung     69   January       0

In [72]:
data['Age'] = 2022 - data.DOB.dt.year
data

      Roll no        DOB    Brand  Marks     Month  Maried  Age
Name
A           1 2008-12-01  Samsung    100  December       0   14
B           2 1996-11-13  Samsung     88  November       0   26
C           3 2000-05-10  Samsung     91       May       0   22
D           4 1999-01-02  Samsung     69   January       0   23